In [1]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 2, 3, 1, 2, 3]])
data

a  1    0.316294
   2    0.549688
   3   -0.255384
b  1    0.093531
   2    0.091141
c  3    0.259497
   1    0.969779
d  2    0.389981
   3    0.489744
dtype: float64

In [2]:
data['a']

1    0.316294
2    0.549688
3   -0.255384
dtype: float64

In [3]:
data['d']

2    0.389981
3    0.489744
dtype: float64

In [4]:
data['c':'d']

c  3    0.259497
   1    0.969779
d  2    0.389981
   3    0.489744
dtype: float64

In [8]:
unstackData=data.unstack()
unstackData

          1         2         3
a  0.316294  0.549688 -0.255384
b  0.093531  0.091141       NaN
c  0.969779       NaN  0.259497
d       NaN  0.389981  0.489744

In [9]:
unstackData.stack()

a  1    0.316294
   2    0.549688
   3   -0.255384
b  1    0.093531
   2    0.091141
c  1    0.969779
   3    0.259497
d  2    0.389981
   3    0.489744
dtype: float64

In [10]:
#DataFrame使用多階層索引
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a','a','b','b'],[1, 2, 1, 2]],
                    columns=[['台北','台北','台中'],['Green','Red','Green']])
frame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [11]:
frame.index.names = ['key1', 'key2']
frame

             台北        台中
          Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [12]:
frame.columns.names = ['縣市', '顏色']
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [13]:
frame['台北']

顏色         Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [14]:
#透過level的加總統計
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [16]:
frame.sum(level='key1')

縣市      台北        台中
顏色   Green Red Green
key1
a        3   5     7
b       15  17    19

In [18]:
frame.sum(level='顏色',axis=1)

顏色         Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [19]:
frame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [20]:
#將DataFrame的欄位變為索引
frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [23]:
#set_index()
frame2=frame.set_index('c')
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [29]:
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [30]:
frame2.sum(level='c')

      a   b  d
c
one   3  18  3
two  18  10  6

In [31]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [33]:
frame3=frame.set_index(['c', 'd'])
frame3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [34]:
#把索引變為欄位
#reset_index()
frame3.reset_index('d')

     d  a  b
c
one  0  0  7
one  1  1  6
one  2  2  5
two  0  3  4
two  1  4  3
two  2  5  2
two  3  6  1